In [12]:
import pandas as pd

# Lê o arquivo CSV do GitHub, base:
# Programa Bolsa Família (PBF) - valor total dos benefícios em dezembro
pbf_df = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PBF.csv", header=1)

pbf_df.head()

,Sigla,Código,Estado,2012,2013,2014,2016,2017,2018,2019,2020,2021,Unnamed: 12
0,AC,12,Acre,13541254,16150692,18666421,21613287,22170410,24004401,23844619,24790463,28141713,NaN
1,AL,27,Alagoas,64992708,68597362,75824150,74168706,75296822,79428048,76202903,79665294,93261844,NaN
2,AM,13,Amazonas,57464682,64639062,73645993,83929449,86896011,93845061,90215464,95075503,108584862,NaN
3,AP,16,Amapá,9427588,9710908,11158658,13266253,14807768,17155390,17204525,17655386,20195936,NaN
4,BA,29,Bahia,262704562,276757279,307377376,324058076,329339879,345273843,332690778,347601624,401903252,NaN

In [13]:
#Remover coluna vazia
pbf_df = pbf_df.drop(columns=["Unnamed: 12"], errors='ignore')

pbf_df.head()

,Sigla,Código,Estado,2012,2013,2014,2016,2017,2018,2019,2020,2021
0,AC,12,Acre,13541254,16150692,18666421,21613287,22170410,24004401,23844619,24790463,28141713
1,AL,27,Alagoas,64992708,68597362,75824150,74168706,75296822,79428048,76202903,79665294,93261844
2,AM,13,Amazonas,57464682,64639062,73645993,83929449,86896011,93845061,90215464,95075503,108584862
3,AP,16,Amapá,9427588,9710908,11158658,13266253,14807768,17155390,17204525,17655386,20195936
4,BA,29,Bahia,262704562,276757279,307377376,324058076,329339879,345273843,332690778,347601624,401903252

In [14]:
#Transpor coluna dos anos
pbf_df = pbf_df.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=pbf_df.columns[3:],var_name="Year", value_name="pbf")

pbf_df.head()

  Sigla  Código    Estado  Year        pbf
0    AC      12      Acre  2012   13541254
1    AL      27   Alagoas  2012   64992708
2    AM      13  Amazonas  2012   57464682
3    AP      16     Amapá  2012    9427588
4    BA      29     Bahia  2012  262704562

In [15]:
# Lê o arquivo CSV do GitHub, base:
# IDHM Ajustado à Desigualdade (IDHAD)
idhad_df = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_IDHAD.csv", header=1)

idhad_df.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,0.502,0.511,0.520,0.523,0.526,0.515,0.531,0.533,0.564,0.521,NaN
1,AL,27,Alagoas,0.475,0.471,0.481,0.483,0.491,0.494,0.490,0.500,0.517,0.505,NaN
2,AM,13,Amazonas,0.512,0.530,0.531,0.535,0.529,0.540,0.547,0.549,0.560,0.532,NaN
3,AP,16,Amapá,0.542,0.563,0.557,0.546,0.548,0.547,0.551,0.567,0.559,0.523,NaN
4,BA,29,Bahia,0.490,0.498,0.519,0.522,0.522,0.517,0.518,0.529,0.549,0.507,NaN

In [16]:
#Remover coluna vazia e transpor colunas dos anos
idhad_df = idhad_df.drop(columns=["Unnamed: 13"], errors='ignore')

idhad_df = idhad_df.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=idhad_df.columns[3:],var_name="Year", value_name="idhad")

idhad_df.head()

  Sigla  Código    Estado  Year  idhad
0    AC      12      Acre  2012  0.502
1    AL      27   Alagoas  2012  0.475
2    AM      13  Amazonas  2012  0.512
3    AP      16     Amapá  2012  0.542
4    BA      29     Bahia  2012  0.490

In [17]:
# Lê o arquivo CSV do GitHub, base:
# Esperança de vida ao nascer (EVN)
evn_df = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_EVN.csv", header=1)

evn_df.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,72.47,72.84,73.21,73.56,73.89,74.20,74.51,74.78,74.47,72.26,NaN
1,AL,27,Alagoas,69.96,70.37,70.77,71.16,71.54,71.90,72.25,72.60,72.15,69.87,NaN
2,AM,13,Amazonas,70.85,71.11,71.36,71.61,71.85,72.08,72.31,72.53,71.99,69.61,NaN
3,AP,16,Amapá,72.77,73.07,73.37,73.65,73.92,74.18,74.42,74.66,73.91,71.70,NaN
4,BA,29,Bahia,72.39,72.66,72.91,73.16,73.40,73.64,73.87,74.09,73.66,71.34,NaN

In [18]:
#Remover coluna vazia e transpor colunas dos anos
evn_df = evn_df.drop(columns=["Unnamed: 13"], errors='ignore')

evn_df = evn_df.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=evn_df.columns[3:],var_name="Year", value_name="evn")

evn_df.head()

  Sigla  Código    Estado  Year    evn
0    AC      12      Acre  2012  72.47
1    AL      27   Alagoas  2012  69.96
2    AM      13  Amazonas  2012  70.85
3    AP      16     Amapá  2012  72.77
4    BA      29     Bahia  2012  72.39

In [19]:
# Lê o arquivo CSV do GitHub, base:
# Percentual de 6 a 14 anos de idade na escola
perc_e_df = pd.read_csv("https://raw.githubusercontent.com/gugalbdias/ICDP/main/ipeadata_PercCriancasEscola.csv", header=1)

perc_e_df.head()

,Sigla,Código,Estado,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 13
0,AC,12,Acre,97.14,96.80,97.41,97.89,97.57,96.30,96.73,98.53,99.25,97.90,NaN
1,AL,27,Alagoas,97.49,96.77,97.82,97.13,98.28,98.49,98.85,98.60,99.04,96.69,NaN
2,AM,13,Amazonas,96.75,98.01,97.35,97.23,97.82,99.06,98.33,97.58,97.88,97.58,NaN
3,AP,16,Amapá,96.46,96.97,97.59,98.12,98.23,98.24,99.28,97.61,98.66,97.41,NaN
4,BA,29,Bahia,97.98,97.98,98.42,99.00,99.07,98.56,98.96,99.20,98.86,98.27,NaN

In [20]:
#Remover coluna vazia e transpor colunas dos anos:
perc_e_df = perc_e_df.drop(columns=["Unnamed: 13"], errors='ignore')

perc_e_df = perc_e_df.melt(id_vars=["Sigla", "Código", "Estado"], value_vars=perc_e_df.columns[3:],var_name="Year", value_name="perc_escola")

perc_e_df.head()

  Sigla  Código    Estado  Year  perc_escola
0    AC      12      Acre  2012        97.14
1    AL      27   Alagoas  2012        97.49
2    AM      13  Amazonas  2012        96.75
3    AP      16     Amapá  2012        96.46
4    BA      29     Bahia  2012        97.98

In [21]:
df_unificado = pd.merge(perc_e_df, pbf_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

  Sigla  Código    Estado  Year  perc_escola          pbf
0    AC      12      Acre  2012        97.14   13541254.0
1    AL      27   Alagoas  2012        97.49   64992708.0
2    AM      13  Amazonas  2012        96.75   57464682.0
3    AP      16     Amapá  2012        96.46    9427588.0
4    BA      29     Bahia  2012        97.98  262704562.0

In [22]:
df_unificado = pd.merge(df_unificado, evn_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

  Sigla  Código    Estado  Year  perc_escola          pbf    evn
0    AC      12      Acre  2012        97.14   13541254.0  72.47
1    AL      27   Alagoas  2012        97.49   64992708.0  69.96
2    AM      13  Amazonas  2012        96.75   57464682.0  70.85
3    AP      16     Amapá  2012        96.46    9427588.0  72.77
4    BA      29     Bahia  2012        97.98  262704562.0  72.39

In [23]:
df_unificado = pd.merge(df_unificado, idhad_df, on=["Sigla", "Código", "Estado","Year"], how='outer')

df_unificado.head()

  Sigla  Código    Estado  Year  perc_escola          pbf    evn  idhad
0    AC      12      Acre  2012        97.14   13541254.0  72.47  0.502
1    AL      27   Alagoas  2012        97.49   64992708.0  69.96  0.475
2    AM      13  Amazonas  2012        96.75   57464682.0  70.85  0.512
3    AP      16     Amapá  2012        96.46    9427588.0  72.77  0.542
4    BA      29     Bahia  2012        97.98  262704562.0  72.39  0.490

In [24]:
regioes = {
    'Acre': 'Norte',
    'Alagoas': 'Nordeste',
    'Amapá': 'Norte',
    'Amazonas': 'Norte',
    'Bahia': 'Nordeste',
    'Ceará': 'Nordeste',
    'Distrito Federal': 'Centro-Oeste',
    'Espírito Santo': 'Sudeste',
    'Goiás': 'Centro-Oeste',
    'Maranhão': 'Nordeste',
    'Mato Grosso': 'Centro-Oeste',
    'Mato Grosso do Sul': 'Centro-Oeste',
    'Minas Gerais': 'Sudeste',
    'Pará': 'Norte',
    'Paraíba': 'Nordeste',
    'Paraná': 'Sul',
    'Pernambuco': 'Nordeste',
    'Piauí': 'Nordeste',
    'Rio de Janeiro': 'Sudeste',
    'Rio Grande do Norte': 'Nordeste',
    'Rio Grande do Sul': 'Sul',
    'Rondônia': 'Norte',
    'Roraima': 'Norte',
    'Santa Catarina': 'Sul',
    'São Paulo': 'Sudeste',
    'Sergipe': 'Nordeste',
    'Tocantins': 'Norte'
}

df_regioes = pd.DataFrame({
    "Estado": df_unificado["Estado"],
    "Região": df_unificado["Estado"].str.strip().map(regioes)
})

df_regioes

                Estado    Região
0                 Acre     Norte
1              Alagoas  Nordeste
2             Amazonas     Norte
3                Amapá     Norte
4                Bahia  Nordeste
..                 ...       ...
265  Rio Grande do Sul       Sul
266     Santa Catarina       Sul
267            Sergipe  Nordeste
268          São Paulo   Sudeste
269          Tocantins     Norte

[270 rows x 2 columns]

In [26]:
df_unificado = pd.merge(df_unificado, df_regioes, on=["Estado"], how='outer')

df_unificado

,Sigla,Código,Estado,Year,perc_escola,pbf,evn,idhad,Região_x,Região_y
0,AC,12,Acre,2012,97.14,13541254.0,72.47,0.502,Norte,Norte
1,AC,12,Acre,2012,97.14,13541254.0,72.47,0.502,Norte,Norte
2,AC,12,Acre,2012,97.14,13541254.0,72.47,0.502,Norte,Norte
3,AC,12,Acre,2012,97.14,13541254.0,72.47,0.502,Norte,Norte
4,AC,12,Acre,2012,97.14,13541254.0,72.47,0.502,Norte,Norte
...,...,...,...,...,...,...,...,...,...,...
26995,TO,17,Tocantins,2021,98.86,26979493.0,71.74,0.568,Norte,Norte
26996,TO,17,Tocantins,2021,98.86,26979493.0,71.74,0.568,Norte,Norte
26997,TO,17,Tocantins,2021,98.86,26979493.0,71.74,0.568,Norte,Norte
26998,TO,17,Tocantins,2021,98.86,26979493.0,71.74,0.568,Norte,Norte
26999,TO,17,Tocantins,2021,98.86,26979493.0,71.74,0.568,Norte,Norte